kabel42/ch32v003/ch32v003_mmr.h
#include <stdint.h>

typedef struct {
	uint32_t :1;
	uint32_t PDDS :1;
	uint32_t :2;
	uint32_t PVDE :1;
	uint32_t PLS :3;
	uint32_t :24;
} pwr_ctlr_t;

typedef struct {
	uint32_t :2;
	uint32_t PVDO :1;
	uint32_t :29;
} pwr_csr_t;

typedef struct {
	uint32_t :1;
	uint32_t AWUEN :1;
	uint32_t :30;
} pwr_awucsr_t;

typedef struct {
	uint32_t AWUAPR :6;
	uint32_t :26;
} pwr_awuapr_t;

typedef struct {
	uint32_t AWUPSC :4;
	uint32_t :28;
} pwr_awupsc_t;

typedef struct {
	uint32_t HSION :1;
	uint32_t HSIRDY :1;
	uint32_t :1;
	uint32_t HSITRIM :5;
	uint32_t HSICAL :8;
	uint32_t HSEON :1;
	uint32_t HSERDY :1;
	uint32_t HSEBYP :1;
	uint32_t CSSON :1;
	uint32_t :4;
	uint32_t PLLON :1;
	uint32_t PLLRDY :1;
	uint32_t :6;
} rcc_ctlr_t;

typedef struct {
	uint32_t SW :2;
	uint32_t SWS :2;
	uint32_t HPRE :4;
	uint32_t PPRE1 :3;
	uint32_t PPRE2 :3;
	uint32_t ADCPRE :2;
	uint32_t PLLSRC :1;
	uint32_t :7;
	uint32_t MCO :3;
	uint32_t :5;
} rcc_cfgr0_t;

typedef struct {
	uint32_t LSIRDYF :1;
	uint32_t :1;
	uint32_t HSIRDYF :1;
	uint32_t HSERDYF :1;
	uint32_t PLLRDYF :1;
	uint32_t :2;
	uint32_t CSSF :1;
	uint32_t LSIRDYIE :1;
	uint32_t :1;
	uint32_t HSIRDYIE :1;
	uint32_t HSERDYIE :1;
	uint32_t PLLRDYIE :1;
	uint32_t :3;
	uint32_t LSIRDYC :1;
	uint32_t :1;
	uint32_t HSIRDYC :1;
	uint32_t HSERDYC :1;
	uint32_t PLLRDYC :1;
	uint32_t :2;
	uint32_t CSSC :1;
	uint32_t :8;
} rcc_intr_t;

typedef struct {
	uint32_t AFIORST :1;
	uint32_t :1;
	uint32_t IOPARST :1;
	uint32_t :1;
	uint32_t IOPCRST :1;
	uint32_t IOPDRST :1;
	uint32_t :3;
	uint32_t ADC1RST :1;
	uint32_t :1;
	uint32_t TIM1RST :1;
	uint32_t SPI1RST :1;
	uint32_t :1;
	uint32_t USART1RST :1;
	uint32_t :17;
} rcc_apb2prstr_t;

typedef struct {
	uint32_t :11;
	uint32_t WWDGRST :1;
	uint32_t :9;
	uint32_t I2C1RST :1;
	uint32_t :6;
	uint32_t PWRRST :1;
	uint32_t :3;
} rcc_apb1prstr_t;

typedef struct {
	uint32_t DMA1EN :1;
	uint32_t :1;
	uint32_t SRAMEN :1;
	uint32_t :29;
} rcc_ahbpcenr_t;

typedef struct {
	uint32_t AFIOEN :1;
	uint32_t :1;
	uint32_t IOPAEN :1;
	uint32_t :1;
	uint32_t IOPCEN :1;
	uint32_t IOPDEN :1;
	uint32_t :3;
	uint32_t ADC1EN :1;
	uint32_t :1;
	uint32_t TIM1EN :1;
	uint32_t SPI1EN :1;
	uint32_t :1;
	uint32_t USART1EN :1;
	uint32_t :17;
} rcc_apb2pcenr_t;

typedef struct {
	uint32_t TIM2EN :1;
	uint32_t :10;
	uint32_t WWDGEN :1;
	uint32_t :9;
	uint32_t I2C1EN :1;
	uint32_t :6;
	uint32_t PWREN :1;
	uint32_t :3;
} rcc_apb1pcenr_t;

typedef struct {
	uint32_t LSION :1;
	uint32_t LSIRDY :1;
	uint32_t :22;
	uint32_t RMVF :1;
	uint32_t :1;
	uint32_t PINRSTF :1;
	uint32_t PORRSTF :1;
	uint32_t SFTRSTF :1;
	uint32_t IWDGRSTF :1;
	uint32_t WWDGRSTF :1;
	uint32_t LPWRRSTF :1;
} rcc_rstsckr_t;

typedef struct {
	uint32_t PLL_CFG :4;
	uint32_t :2;
	uint32_t LOCKUP_EN :1;
	uint32_t LOCKUP_RESET :1;
	uint32_t :2;
	uint32_t LDO_TRIM :1;
	uint32_t FLASH_CLK_TRIM :3;
	uint32_t WR_EN :1;
	uint32_t WR_LOCK :1;
	uint32_t OPA_EN :1;
	uint32_t OPA_NSEL :1;
	uint32_t OPA_PSEL :1;
	uint32_t :13;
} extend_extend_ctr_t;

typedef struct {
	uint32_t MODE0 :2;
	uint32_t CNF0 :2;
	uint32_t MODE1 :2;
	uint32_t CNF1 :2;
	uint32_t MODE2 :2;
	uint32_t CNF2 :2;
	uint32_t MODE3 :2;
	uint32_t CNF3 :2;
	uint32_t MODE4 :2;
	uint32_t CNF4 :2;
	uint32_t MODE5 :2;
	uint32_t CNF5 :2;
	uint32_t MODE6 :2;
	uint32_t CNF6 :2;
	uint32_t MODE7 :2;
	uint32_t CNF7 :2;
} gpioa_cfglr_t;

typedef struct {
	uint32_t IDR0 :1;
	uint32_t IDR1 :1;
	uint32_t IDR2 :1;
	uint32_t IDR3 :1;
	uint32_t IDR4 :1;
	uint32_t IDR5 :1;
	uint32_t IDR6 :1;
	uint32_t IDR7 :1;
	uint32_t :24;
} gpioa_indr_t;

typedef struct {
	uint32_t ODR0 :1;
	uint32_t ODR1 :1;
	uint32_t ODR2 :1;
	uint32_t ODR3 :1;
	uint32_t ODR4 :1;
	uint32_t ODR5 :1;
	uint32_t ODR6 :1;
	uint32_t ODR7 :1;
	uint32_t :24;
} gpioa_outdr_t;

typedef struct {
	uint32_t BS0 :1;
	uint32_t BS1 :1;
	uint32_t BS2 :1;
	uint32_t BS3 :1;
	uint32_t BS4 :1;
	uint32_t BS5 :1;
	uint32_t BS6 :1;
	uint32_t BS7 :1;
	uint32_t :8;
	uint32_t BR0 :1;
	uint32_t BR1 :1;
	uint32_t BR2 :1;
	uint32_t BR3 :1;
	uint32_t BR4 :1;
	uint32_t BR5 :1;
	uint32_t BR6 :1;
	uint32_t BR7 :1;
	uint32_t :8;
} gpioa_bshr_t;

typedef struct {
	uint32_t BR0 :1;
	uint32_t BR1 :1;
	uint32_t BR2 :1;
	uint32_t BR3 :1;
	uint32_t BR4 :1;
	uint32_t BR5 :1;
	uint32_t BR6 :1;
	uint32_t BR7 :1;
	uint32_t :24;
} gpioa_bcr_t;

typedef struct {
	uint32_t LCK0 :1;
	uint32_t LCK1 :1;
	uint32_t LCK2 :1;
	uint32_t LCK3 :1;
	uint32_t LCK4 :1;
	uint32_t LCK5 :1;
	uint32_t LCK6 :1;
	uint32_t LCK7 :1;
	uint32_t LCKK :1;
	uint32_t :23;
} gpioa_lckr_t;

typedef struct {
	uint32_t MODE0 :2;
	uint32_t CNF0 :2;
	uint32_t MODE1 :2;
	uint32_t CNF1 :2;
	uint32_t MODE2 :2;
	uint32_t CNF2 :2;
	uint32_t MODE3 :2;
	uint32_t CNF3 :2;
	uint32_t MODE4 :2;
	uint32_t CNF4 :2;
	uint32_t MODE5 :2;
	uint32_t CNF5 :2;
	uint32_t MODE6 :2;
	uint32_t CNF6 :2;
	uint32_t MODE7 :2;
	uint32_t CNF7 :2;
} gpioc_cfglr_t;

typedef struct {
	uint32_t IDR0 :1;
	uint32_t IDR1 :1;
	uint32_t IDR2 :1;
	uint32_t IDR3 :1;
	uint32_t IDR4 :1;
	uint32_t IDR5 :1;
	uint32_t IDR6 :1;
	uint32_t IDR7 :1;
	uint32_t :24;
} gpioc_indr_t;

typedef struct {
	uint32_t ODR0 :1;
	uint32_t ODR1 :1;
	uint32_t ODR2 :1;
	uint32_t ODR3 :1;
	uint32_t ODR4 :1;
	uint32_t ODR5 :1;
	uint32_t ODR6 :1;
	uint32_t ODR7 :1;
	uint32_t :24;
} gpioc_outdr_t;

typedef struct {
	uint32_t BS0 :1;
	uint32_t BS1 :1;
	uint32_t BS2 :1;
	uint32_t BS3 :1;
	uint32_t BS4 :1;
	uint32_t BS5 :1;
	uint32_t BS6 :1;
	uint32_t BS7 :1;
	uint32_t :8;
	uint32_t BR0 :1;
	uint32_t BR1 :1;
	uint32_t BR2 :1;
	uint32_t BR3 :1;
	uint32_t BR4 :1;
	uint32_t BR5 :1;
	uint32_t BR6 :1;
	uint32_t BR7 :1;
	uint32_t :8;
} gpioc_bshr_t;

typedef struct {
	uint32_t BR0 :1;
	uint32_t BR1 :1;
	uint32_t BR2 :1;
	uint32_t BR3 :1;
	uint32_t BR4 :1;
	uint32_t BR5 :1;
	uint32_t BR6 :1;
	uint32_t BR7 :1;
	uint32_t :24;
} gpioc_bcr_t;

typedef struct {
	uint32_t LCK0 :1;
	uint32_t LCK1 :1;
	uint32_t LCK2 :1;
	uint32_t LCK3 :1;
	uint32_t LCK4 :1;
	uint32_t LCK5 :1;
	uint32_t LCK6 :1;
	uint32_t LCK7 :1;
	uint32_t LCKK :1;
	uint32_t :23;
} gpioc_lckr_t;

