kabel42/ch32v003/ch32v003_mmr.h
typedef struct {
	uint32_t MODE0 :2;
	uint32_t CNF0 :2;
	uint32_t MODE1 :2;
	uint32_t CNF1 :2;
	uint32_t MODE2 :2;
	uint32_t CNF2 :2;
	uint32_t MODE3 :2;
	uint32_t CNF3 :2;
	uint32_t MODE4 :2;
	uint32_t CNF4 :2;
	uint32_t MODE5 :2;
	uint32_t CNF5 :2;
	uint32_t MODE6 :2;
	uint32_t CNF6 :2;
	uint32_t MODE7 :2;
	uint32_t CNF7 :2;
} gpiod_cfglr_t;

typedef struct {
	uint32_t IDR0 :1;
	uint32_t IDR1 :1;
	uint32_t IDR2 :1;
	uint32_t IDR3 :1;
	uint32_t IDR4 :1;
	uint32_t IDR5 :1;
	uint32_t IDR6 :1;
	uint32_t IDR7 :1;
	uint32_t :24;
} gpiod_indr_t;

typedef struct {
	uint32_t ODR0 :1;
	uint32_t ODR1 :1;
	uint32_t ODR2 :1;
	uint32_t ODR3 :1;
	uint32_t ODR4 :1;
	uint32_t ODR5 :1;
	uint32_t ODR6 :1;
	uint32_t ODR7 :1;
	uint32_t :24;
} gpiod_outdr_t;

typedef struct {
	uint32_t BS0 :1;
	uint32_t BS1 :1;
	uint32_t BS2 :1;
	uint32_t BS3 :1;
	uint32_t BS4 :1;
	uint32_t BS5 :1;
	uint32_t BS6 :1;
	uint32_t BS7 :1;
	uint32_t :8;
	uint32_t BR0 :1;
	uint32_t BR1 :1;
	uint32_t BR2 :1;
	uint32_t BR3 :1;
	uint32_t BR4 :1;
	uint32_t BR5 :1;
	uint32_t BR6 :1;
	uint32_t BR7 :1;
	uint32_t :8;
} gpiod_bshr_t;

typedef struct {
	uint32_t BR0 :1;
	uint32_t BR1 :1;
	uint32_t BR2 :1;
	uint32_t BR3 :1;
	uint32_t BR4 :1;
	uint32_t BR5 :1;
	uint32_t BR6 :1;
	uint32_t BR7 :1;
	uint32_t :24;
} gpiod_bcr_t;

typedef struct {
	uint32_t LCK0 :1;
	uint32_t LCK1 :1;
	uint32_t LCK2 :1;
	uint32_t LCK3 :1;
	uint32_t LCK4 :1;
	uint32_t LCK5 :1;
	uint32_t LCK6 :1;
	uint32_t LCK7 :1;
	uint32_t LCKK :1;
	uint32_t :23;
} gpiod_lckr_t;

typedef struct {
	uint32_t SPI1RM :1;
	uint32_t I2C1RM :1;
	uint32_t USART1RM :1;
	uint32_t :3;
	uint32_t TIM1RM :2;
	uint32_t TIM2RM :2;
	uint32_t :5;
	uint32_t PA12RM :1;
	uint32_t :1;
	uint32_t ADC1_ETRGINJ_RM :1;
	uint32_t ADC1_ETRGREG_RM :1;
	uint32_t :2;
	uint32_t USART1REMAP1 :1;
	uint32_t I2C1REMAP1 :1;
	uint32_t TIM1_IREMAP :1;
	uint32_t SWCFG :3;
	uint32_t :5;
} afio_pcfr_t;

typedef struct {
	uint32_t EXTI0 :2;
	uint32_t EXTI1 :2;
	uint32_t EXTI2 :2;
	uint32_t EXTI3 :2;
	uint32_t EXTI4 :2;
	uint32_t EXTI5 :2;
	uint32_t EXTI6 :2;
	uint32_t EXTI7 :2;
	uint32_t :16;
} afio_exticr_t;

typedef struct {
	uint32_t MR0 :1;
	uint32_t MR1 :1;
	uint32_t MR2 :1;
	uint32_t MR3 :1;
	uint32_t MR4 :1;
	uint32_t MR5 :1;
	uint32_t MR6 :1;
	uint32_t MR7 :1;
	uint32_t MR8 :1;
	uint32_t MR9 :1;
	uint32_t :22;
} exti_intenr_t;

typedef struct {
	uint32_t MR0 :1;
	uint32_t MR1 :1;
	uint32_t MR2 :1;
	uint32_t MR3 :1;
	uint32_t MR4 :1;
	uint32_t MR5 :1;
	uint32_t MR6 :1;
	uint32_t MR7 :1;
	uint32_t MR8 :1;
	uint32_t MR9 :1;
	uint32_t :22;
} exti_evenr_t;

typedef struct {
	uint32_t TR0 :1;
	uint32_t TR1 :1;
	uint32_t TR2 :1;
	uint32_t TR3 :1;
	uint32_t TR4 :1;
	uint32_t TR5 :1;
	uint32_t TR6 :1;
	uint32_t TR7 :1;
	uint32_t TR8 :1;
	uint32_t TR9 :1;
	uint32_t :22;
} exti_rtenr_t;

typedef struct {
	uint32_t TR0 :1;
	uint32_t TR1 :1;
	uint32_t TR2 :1;
	uint32_t TR3 :1;
	uint32_t TR4 :1;
	uint32_t TR5 :1;
	uint32_t TR6 :1;
	uint32_t TR7 :1;
	uint32_t TR8 :1;
	uint32_t TR9 :1;
	uint32_t :22;
} exti_ftenr_t;

typedef struct {
	uint32_t SWIER0 :1;
	uint32_t SWIER1 :1;
	uint32_t SWIER2 :1;
	uint32_t SWIER3 :1;
	uint32_t SWIER4 :1;
	uint32_t SWIER5 :1;
	uint32_t SWIER6 :1;
	uint32_t SWIER7 :1;
	uint32_t SWIER8 :1;
	uint32_t SWIER9 :1;
	uint32_t :22;
} exti_swievr_t;

typedef struct {
	uint32_t PR0 :1;
	uint32_t PR1 :1;
	uint32_t PR2 :1;
	uint32_t PR3 :1;
	uint32_t PR4 :1;
	uint32_t PR5 :1;
	uint32_t PR6 :1;
	uint32_t PR7 :1;
	uint32_t PR8 :1;
	uint32_t PR9 :1;
	uint32_t :22;
} exti_intfr_t;

typedef struct {
	uint32_t GIF1 :1;
	uint32_t TCIF1 :1;
	uint32_t HTIF1 :1;
	uint32_t TEIF1 :1;
	uint32_t GIF2 :1;
	uint32_t TCIF2 :1;
	uint32_t HTIF2 :1;
	uint32_t TEIF2 :1;
	uint32_t GIF3 :1;
	uint32_t TCIF3 :1;
	uint32_t HTIF3 :1;
	uint32_t TEIF3 :1;
	uint32_t GIF4 :1;
	uint32_t TCIF4 :1;
	uint32_t HTIF4 :1;
	uint32_t TEIF4 :1;
	uint32_t GIF5 :1;
	uint32_t TCIF5 :1;
	uint32_t HTIF5 :1;
	uint32_t TEIF5 :1;
	uint32_t GIF6 :1;
	uint32_t TCIF6 :1;
	uint32_t HTIF6 :1;
	uint32_t TEIF6 :1;
	uint32_t GIF7 :1;
	uint32_t TCIF7 :1;
	uint32_t HTIF7 :1;
	uint32_t TEIF7 :1;
	uint32_t :4;
} dma1_intfr_t;

typedef struct {
	uint32_t CGIF1 :1;
	uint32_t CTCIF1 :1;
	uint32_t CHTIF1 :1;
	uint32_t CTEIF1 :1;
	uint32_t CGIF2 :1;
	uint32_t CTCIF2 :1;
	uint32_t CHTIF2 :1;
	uint32_t CTEIF2 :1;
	uint32_t CGIF3 :1;
	uint32_t CTCIF3 :1;
	uint32_t CHTIF3 :1;
	uint32_t CTEIF3 :1;
	uint32_t CGIF4 :1;
	uint32_t CTCIF4 :1;
	uint32_t CHTIF4 :1;
	uint32_t CTEIF4 :1;
	uint32_t CGIF5 :1;
	uint32_t CTCIF5 :1;
	uint32_t CHTIF5 :1;
	uint32_t CTEIF5 :1;
	uint32_t CGIF6 :1;
	uint32_t CTCIF6 :1;
	uint32_t CHTIF6 :1;
	uint32_t CTEIF6 :1;
	uint32_t CGIF7 :1;
	uint32_t CTCIF7 :1;
	uint32_t CHTIF7 :1;
	uint32_t CTEIF7 :1;
	uint32_t :4;
} dma1_intfcr_t;

typedef struct {
	uint32_t EN :1;
	uint32_t TCIE :1;
	uint32_t HTIE :1;
	uint32_t TEIE :1;
	uint32_t DIR :1;
	uint32_t CIRC :1;
	uint32_t PINC :1;
	uint32_t MINC :1;
	uint32_t PSIZE :2;
	uint32_t MSIZE :2;
	uint32_t PL :2;
	uint32_t MEM2MEM :1;
	uint32_t :17;
} dma1_cfgr1_t;

typedef struct {
	uint32_t NDT :16;
	uint32_t :16;
} dma1_cntr1_t;

typedef struct {
	uint32_t EN :1;
	uint32_t TCIE :1;
	uint32_t HTIE :1;
	uint32_t TEIE :1;
	uint32_t DIR :1;
	uint32_t CIRC :1;
	uint32_t PINC :1;
	uint32_t MINC :1;
	uint32_t PSIZE :2;
	uint32_t MSIZE :2;
	uint32_t PL :2;
	uint32_t MEM2MEM :1;
	uint32_t :17;
} dma1_cfgr2_t;

typedef struct {
	uint32_t NDT :16;
	uint32_t :16;
} dma1_cntr2_t;

typedef struct {
	uint32_t EN :1;
	uint32_t TCIE :1;
	uint32_t HTIE :1;
	uint32_t TEIE :1;
	uint32_t DIR :1;
	uint32_t CIRC :1;
	uint32_t PINC :1;
	uint32_t MINC :1;
	uint32_t PSIZE :2;
	uint32_t MSIZE :2;
	uint32_t PL :2;
	uint32_t MEM2MEM :1;
	uint32_t :17;
} dma1_cfgr3_t;

typedef struct {
	uint32_t NDT :16;
	uint32_t :16;
} dma1_cntr3_t;

typedef struct {
	uint32_t EN :1;
	uint32_t TCIE :1;
	uint32_t HTIE :1;
	uint32_t TEIE :1;
	uint32_t DIR :1;
	uint32_t CIRC :1;
	uint32_t PINC :1;
	uint32_t MINC :1;
	uint32_t PSIZE :2;
	uint32_t MSIZE :2;
	uint32_t PL :2;
	uint32_t MEM2MEM :1;
	uint32_t :17;
} dma1_cfgr4_t;

