kabel42/ch32v003/ch32v003_mmr.h
typedef struct {
	uint32_t NDT :16;
	uint32_t :16;
} dma1_cntr4_t;

typedef struct {
	uint32_t EN :1;
	uint32_t TCIE :1;
	uint32_t HTIE :1;
	uint32_t TEIE :1;
	uint32_t DIR :1;
	uint32_t CIRC :1;
	uint32_t PINC :1;
	uint32_t MINC :1;
	uint32_t PSIZE :2;
	uint32_t MSIZE :2;
	uint32_t PL :2;
	uint32_t MEM2MEM :1;
	uint32_t :17;
} dma1_cfgr5_t;

typedef struct {
	uint32_t NDT :16;
	uint32_t :16;
} dma1_cntr5_t;

typedef struct {
	uint32_t EN :1;
	uint32_t TCIE :1;
	uint32_t HTIE :1;
	uint32_t TEIE :1;
	uint32_t DIR :1;
	uint32_t CIRC :1;
	uint32_t PINC :1;
	uint32_t MINC :1;
	uint32_t PSIZE :2;
	uint32_t MSIZE :2;
	uint32_t PL :2;
	uint32_t MEM2MEM :1;
	uint32_t :17;
} dma1_cfgr6_t;

typedef struct {
	uint32_t NDT :16;
	uint32_t :16;
} dma1_cntr6_t;

typedef struct {
	uint32_t EN :1;
	uint32_t TCIE :1;
	uint32_t HTIE :1;
	uint32_t TEIE :1;
	uint32_t DIR :1;
	uint32_t CIRC :1;
	uint32_t PINC :1;
	uint32_t MINC :1;
	uint32_t PSIZE :2;
	uint32_t MSIZE :2;
	uint32_t PL :2;
	uint32_t MEM2MEM :1;
	uint32_t :17;
} dma1_cfgr7_t;

typedef struct {
	uint32_t NDT :16;
	uint32_t :16;
} dma1_cntr7_t;

typedef struct {
	uint32_t KEY :16;
	uint32_t :16;
} iwdg_ctlr_t;

typedef struct {
	uint32_t PR :3;
	uint32_t :29;
} iwdg_pscr_t;

typedef struct {
	uint32_t RL :12;
	uint32_t :20;
} iwdg_rldr_t;

typedef struct {
	uint32_t PVU :1;
	uint32_t RVU :1;
	uint32_t :30;
} iwdg_statr_t;

typedef struct {
	uint32_t T :7;
	uint32_t WDGA :1;
	uint32_t :24;
} wwdg_ctlr_t;

typedef struct {
	uint32_t W :7;
	uint32_t WDGTB :2;
	uint32_t EWI :1;
	uint32_t :22;
} wwdg_cfgr_t;

typedef struct {
	uint32_t WEIF :1;
	uint32_t :31;
} wwdg_statr_t;

typedef struct {
	uint32_t CEN :1;
	uint32_t UDIS :1;
	uint32_t URS :1;
	uint32_t OPM :1;
	uint32_t DIR :1;
	uint32_t CMS :2;
	uint32_t ARPE :1;
	uint32_t CKD :2;
	uint32_t :4;
	uint32_t TMR_CAP_OV_EN :1;
	uint32_t TMR_CAP_LVL_EN :1;
	uint32_t :16;
} tim1_ctlr1_t;

typedef struct {
	uint32_t CCPC :1;
	uint32_t :1;
	uint32_t CCUS :1;
	uint32_t CCDS :1;
	uint32_t MMS :3;
	uint32_t TI1S :1;
	uint32_t OIS1 :1;
	uint32_t OIS1N :1;
	uint32_t OIS2 :1;
	uint32_t OIS2N :1;
	uint32_t OIS3 :1;
	uint32_t OIS3N :1;
	uint32_t OIS4 :1;
	uint32_t :17;
} tim1_ctlr2_t;

typedef struct {
	uint32_t SMS :3;
	uint32_t :1;
	uint32_t TS :3;
	uint32_t MSM :1;
	uint32_t ETF :4;
	uint32_t ETPS :2;
	uint32_t ECE :1;
	uint32_t ETP :1;
	uint32_t :16;
} tim1_smcfgr_t;

typedef struct {
	uint32_t UIE :1;
	uint32_t CC1IE :1;
	uint32_t CC2IE :1;
	uint32_t CC3IE :1;
	uint32_t CC4IE :1;
	uint32_t COMIE :1;
	uint32_t TIE :1;
	uint32_t BIE :1;
	uint32_t UDE :1;
	uint32_t CC1DE :1;
	uint32_t CC2DE :1;
	uint32_t CC3DE :1;
	uint32_t CC4DE :1;
	uint32_t COMDE :1;
	uint32_t TDE :1;
	uint32_t :17;
} tim1_dmaintenr_t;

typedef struct {
	uint32_t UIF :1;
	uint32_t CC1IF :1;
	uint32_t CC2IF :1;
	uint32_t CC3IF :1;
	uint32_t CC4IF :1;
	uint32_t COMIF :1;
	uint32_t TIF :1;
	uint32_t BIF :1;
	uint32_t :1;
	uint32_t CC1OF :1;
	uint32_t CC2OF :1;
	uint32_t CC3OF :1;
	uint32_t CC4OF :1;
	uint32_t :19;
} tim1_intfr_t;

typedef struct {
	uint32_t UG :1;
	uint32_t CC1G :1;
	uint32_t CC2G :1;
	uint32_t CC3G :1;
	uint32_t CC4G :1;
	uint32_t COMG :1;
	uint32_t TG :1;
	uint32_t BG :1;
	uint32_t :24;
} tim1_swevgr_t;

typedef union {
	struct {
		uint32_t CC1S :2;
		uint32_t OC1FE :1;
		uint32_t OC1PE :1;
		uint32_t OC1M :3;
		uint32_t OC1CE :1;
		uint32_t CC2S :2;
		uint32_t OC2FE :1;
		uint32_t OC2PE :1;
		uint32_t OC2M :3;
		uint32_t OC2CE :1;
		uint32_t :16;
	} chctlr1_output_bits;
	struct {
		uint32_t CC1S :2;
		uint32_t IC1PSC :2;
		uint32_t IC1F :4;
		uint32_t CC2S :2;
		uint32_t IC2PCS :2;
		uint32_t IC2F :4;
		uint32_t :16;
	} chctlr1_input_bits;
} tim1_chctlr1_t;

typedef union {
	struct {
		uint32_t CC3S :2;
		uint32_t OC3FE :1;
		uint32_t OC3PE :1;
		uint32_t OC3M :3;
		uint32_t OC3CE :1;
		uint32_t CC4S :2;
		uint32_t OC4FE :1;
		uint32_t OC4PE :1;
		uint32_t OC4M :3;
		uint32_t OC4CE :1;
		uint32_t :16;
	} chctlr2_output_bits;
	struct {
		uint32_t CC3S :2;
		uint32_t IC3PSC :2;
		uint32_t IC3F :4;
		uint32_t CC4S :2;
		uint32_t IC4PSC :2;
		uint32_t IC4F :4;
		uint32_t :16;
	} chctlr2_input_bits;
} tim1_chctlr2_t;

typedef struct {
	uint32_t CC1E :1;
	uint32_t CC1P :1;
	uint32_t CC1NE :1;
	uint32_t CC1NP :1;
	uint32_t CC2E :1;
	uint32_t CC2P :1;
	uint32_t CC2NE :1;
	uint32_t CC2NP :1;
	uint32_t CC3E :1;
	uint32_t CC3P :1;
	uint32_t CC3NE :1;
	uint32_t CC3NP :1;
	uint32_t CC4E :1;
	uint32_t CC4P :1;
	uint32_t :18;
} tim1_ccer_t;

typedef struct {
	uint32_t CNT :16;
	uint32_t :16;
} tim1_cnt_t;

typedef struct {
	uint32_t PSC :16;
	uint32_t :16;
} tim1_psc_t;

typedef struct {
	uint32_t ATRLR :16;
	uint32_t :16;
} tim1_atrlr_t;

typedef struct {
	uint32_t RPTCR :8;
	uint32_t :24;
} tim1_rptcr_t;

typedef struct {
	uint32_t CH1CVR :16;
	uint32_t :16;
} tim1_ch1cvr_t;

typedef struct {
	uint32_t CH2CVR :16;
	uint32_t :16;
} tim1_ch2cvr_t;

typedef struct {
	uint32_t CH3CVR :16;
	uint32_t :16;
} tim1_ch3cvr_t;

typedef struct {
	uint32_t CH4CVR :16;
	uint32_t :16;
} tim1_ch4cvr_t;

typedef struct {
	uint32_t DTG :8;
	uint32_t LOCK :2;
	uint32_t OSSI :1;
	uint32_t OSSR :1;
	uint32_t BKE :1;
	uint32_t BKP :1;
	uint32_t AOE :1;
	uint32_t MOE :1;
	uint32_t :16;
} tim1_bdtr_t;

typedef struct {
	uint32_t DBA :5;
	uint32_t :3;
	uint32_t DBL :5;
	uint32_t :19;
} tim1_dmacfgr_t;

typedef struct {
	uint32_t DMAADR :16;
	uint32_t :16;
} tim1_dmaadr_t;

typedef struct {
	uint32_t CEN :1;
	uint32_t UDIS :1;
	uint32_t URS :1;
	uint32_t OPM :1;
	uint32_t DIR :1;
	uint32_t CMS :2;
	uint32_t ARPE :1;
	uint32_t CKD :2;
	uint32_t :4;
	uint32_t TMR_CAP_OV_EN :1;
	uint32_t TMR_CAP_LVL_EN :1;
	uint32_t :16;
} tim2_ctlr1_t;

typedef struct {
	uint32_t :3;
	uint32_t CCDS :1;
	uint32_t MMS :3;
	uint32_t TI1S :1;
	uint32_t :24;
} tim2_ctlr2_t;

typedef struct {
	uint32_t SMS :3;
	uint32_t :1;
	uint32_t TS :3;
	uint32_t MSM :1;
	uint32_t ETF :4;
	uint32_t ETPS :2;
	uint32_t ECE :1;
	uint32_t ETP :1;
	uint32_t :16;
} tim2_smcfgr_t;

typedef struct {
	uint32_t UIE :1;
	uint32_t CC1IE :1;
	uint32_t CC2IE :1;
	uint32_t CC3IE :1;
	uint32_t CC4IE :1;
	uint32_t :1;
	uint32_t TIE :1;
	uint32_t :1;
	uint32_t UDE :1;
	uint32_t CC1DE :1;
	uint32_t CC2DE :1;
	uint32_t CC3DE :1;
	uint32_t CC4DE :1;
	uint32_t :1;
	uint32_t TDE :1;
	uint32_t :17;
} tim2_dmaintenr_t;

