kabel42/ch32v003/ch32v003_mmr.h
typedef struct {
	uint32_t UIF :1;
	uint32_t CC1IF :1;
	uint32_t CC2IF :1;
	uint32_t CC3IF :1;
	uint32_t CC4IF :1;
	uint32_t :1;
	uint32_t TIF :1;
	uint32_t :2;
	uint32_t CC1OF :1;
	uint32_t CC2OF :1;
	uint32_t CC3OF :1;
	uint32_t CC4OF :1;
	uint32_t :19;
} tim2_intfr_t;

typedef struct {
	uint32_t UG :1;
	uint32_t CC1G :1;
	uint32_t CC2G :1;
	uint32_t CC3G :1;
	uint32_t CC4G :1;
	uint32_t :1;
	uint32_t TG :1;
	uint32_t :25;
} tim2_swevgr_t;

typedef union {
	struct {
		uint32_t CC1S :2;
		uint32_t OC1FE :1;
		uint32_t OC1PE :1;
		uint32_t OC1M :3;
		uint32_t OC1CE :1;
		uint32_t CC2S :2;
		uint32_t OC2FE :1;
		uint32_t OC2PE :1;
		uint32_t OC2M :3;
		uint32_t OC2CE :1;
		uint32_t :16;
	} chctlr1_output_bits;
	struct {
		uint32_t CC1S :2;
		uint32_t IC1PSC :2;
		uint32_t IC1F :4;
		uint32_t CC2S :2;
		uint32_t IC2PSC :2;
		uint32_t IC2F :4;
		uint32_t :16;
	} chctlr1_input_bits;
} tim2_chctlr1_t;

typedef union {
	struct {
		uint32_t CC3S :2;
		uint32_t OC3FE :1;
		uint32_t OC3PE :1;
		uint32_t OC3M :3;
		uint32_t OC3CE :1;
		uint32_t CC4S :2;
		uint32_t OC4FE :1;
		uint32_t OC4PE :1;
		uint32_t OC4M :3;
		uint32_t OC4CE :1;
		uint32_t :16;
	} chctlr2_output_bits;
	struct {
		uint32_t CC3S :2;
		uint32_t IC3PSC :2;
		uint32_t IC3F :4;
		uint32_t CC4S :2;
		uint32_t IC4PSC :2;
		uint32_t IC4F :4;
		uint32_t :16;
	} chctlr2_input_bits;
} tim2_chctlr2_t;

typedef struct {
	uint32_t CC1E :1;
	uint32_t CC1P :1;
	uint32_t :2;
	uint32_t CC2E :1;
	uint32_t CC2P :1;
	uint32_t :2;
	uint32_t CC3E :1;
	uint32_t CC3P :1;
	uint32_t :2;
	uint32_t CC4E :1;
	uint32_t CC4P :1;
	uint32_t :18;
} tim2_ccer_t;

typedef struct {
	uint32_t CNT :16;
	uint32_t :16;
} tim2_cnt_t;

typedef struct {
	uint32_t PSC :16;
	uint32_t :16;
} tim2_psc_t;

typedef struct {
	uint32_t ATRLR :16;
	uint32_t :16;
} tim2_atrlr_t;

typedef struct {
	uint32_t CH1CVR :16;
	uint32_t :16;
} tim2_ch1cvr_t;

typedef struct {
	uint32_t CH2CVR :16;
	uint32_t :16;
} tim2_ch2cvr_t;

typedef struct {
	uint32_t CH3CVR :16;
	uint32_t :16;
} tim2_ch3cvr_t;

typedef struct {
	uint32_t CH4CVR :16;
	uint32_t :16;
} tim2_ch4cvr_t;

typedef struct {
	uint32_t DBA :5;
	uint32_t :3;
	uint32_t DBL :5;
	uint32_t :19;
} tim2_dmacfgr_t;

typedef struct {
	uint32_t DMAADR :16;
	uint32_t :16;
} tim2_dmaadr_t;

typedef struct {
	uint32_t PE :1;
	uint32_t :3;
	uint32_t ENARP :1;
	uint32_t ENPEC :1;
	uint32_t ENGC :1;
	uint32_t NOSTRETCH :1;
	uint32_t START :1;
	uint32_t STOP :1;
	uint32_t ACK :1;
	uint32_t POS :1;
	uint32_t PEC :1;
	uint32_t :2;
	uint32_t SWRST :1;
	uint32_t :16;
} i2c1_ctlr1_t;

typedef struct {
	uint32_t FREQ :6;
	uint32_t :2;
	uint32_t ITERREN :1;
	uint32_t ITEVTEN :1;
	uint32_t ITBUFEN :1;
	uint32_t DMAEN :1;
	uint32_t LAST :1;
	uint32_t :19;
} i2c1_ctlr2_t;

typedef struct {
	uint32_t ADD0 :1;
	uint32_t ADD7_1 :7;
	uint32_t ADD9_8 :2;
	uint32_t :5;
	uint32_t ADDMODE :1;
	uint32_t :16;
} i2c1_oaddr1_t;

typedef struct {
	uint32_t ENDUAL :1;
	uint32_t ADD2 :7;
	uint32_t :24;
} i2c1_oaddr2_t;

typedef struct {
	uint32_t DATAR :8;
	uint32_t :24;
} i2c1_datar_t;

typedef struct {
	uint32_t SB :1;
	uint32_t ADDR :1;
	uint32_t BTF :1;
	uint32_t ADD10 :1;
	uint32_t STOPF :1;
	uint32_t :1;
	uint32_t RxNE :1;
	uint32_t TxE :1;
	uint32_t BERR :1;
	uint32_t ARLO :1;
	uint32_t AF :1;
	uint32_t OVR :1;
	uint32_t PECERR :1;
	uint32_t :19;
} i2c1_star1_t;

typedef struct {
	uint32_t MSL :1;
	uint32_t BUSY :1;
	uint32_t TRA :1;
	uint32_t :1;
	uint32_t GENCALL :1;
	uint32_t :2;
	uint32_t DUALF :1;
	uint32_t PEC :8;
	uint32_t :16;
} i2c1_star2_t;

typedef struct {
	uint32_t CCR :12;
	uint32_t :2;
	uint32_t DUTY :1;
	uint32_t F_S :1;
	uint32_t :16;
} i2c1_ckcfgr_t;

typedef struct {
	uint32_t CPHA :1;
	uint32_t CPOL :1;
	uint32_t MSTR :1;
	uint32_t BR :3;
	uint32_t SPE :1;
	uint32_t LSBFIRST :1;
	uint32_t SSI :1;
	uint32_t SSM :1;
	uint32_t RXONLY :1;
	uint32_t DFF :1;
	uint32_t CRCNEXT :1;
	uint32_t CRCEN :1;
	uint32_t BIDIOE :1;
	uint32_t BIDIMODE :1;
	uint32_t :16;
} spi1_ctlr1_t;

typedef struct {
	uint32_t RXDMAEN :1;
	uint32_t TXDMAEN :1;
	uint32_t SSOE :1;
	uint32_t :2;
	uint32_t ERRIE :1;
	uint32_t RXNEIE :1;
	uint32_t TXEIE :1;
	uint32_t :24;
} spi1_ctlr2_t;

typedef struct {
	uint32_t RXNE :1;
	uint32_t TXE :1;
	uint32_t CHSID :1;
	uint32_t UDR :1;
	uint32_t CRCERR :1;
	uint32_t MODF :1;
	uint32_t OVR :1;
	uint32_t BSY :1;
	uint32_t :24;
} spi1_statr_t;

typedef struct {
	uint32_t DATAR :16;
	uint32_t :16;
} spi1_datar_t;

typedef struct {
	uint32_t CRCPOLY :16;
	uint32_t :16;
} spi1_crcr_t;

typedef struct {
	uint32_t RXCRC :16;
	uint32_t :16;
} spi1_rcrcr_t;

typedef struct {
	uint32_t TXCRC :16;
	uint32_t :16;
} spi1_tcrcr_t;

typedef struct {
	uint32_t HSRXEN :1;
	uint32_t :31;
} spi1_hscr_t;

typedef struct {
	uint32_t PE :1;
	uint32_t FE :1;
	uint32_t NE :1;
	uint32_t ORE :1;
	uint32_t IDLE :1;
	uint32_t RXNE :1;
	uint32_t TC :1;
	uint32_t TXE :1;
	uint32_t LBD :1;
	uint32_t CTS :1;
	uint32_t :22;
} usart1_statr_t;

typedef struct {
	uint32_t DR :9;
	uint32_t :23;
} usart1_datar_t;

typedef struct {
	uint32_t DIV_Fraction :4;
	uint32_t DIV_Mantissa :12;
	uint32_t :16;
} usart1_brr_t;

typedef struct {
	uint32_t SBK :1;
	uint32_t RWU :1;
	uint32_t RE :1;
	uint32_t TE :1;
	uint32_t IDLEIE :1;
	uint32_t RXNEIE :1;
	uint32_t TCIE :1;
	uint32_t TXEIE :1;
	uint32_t PEIE :1;
	uint32_t PS :1;
	uint32_t PCE :1;
	uint32_t WAKE :1;
	uint32_t M :1;
	uint32_t UE :1;
	uint32_t :18;
} usart1_ctlr1_t;

typedef struct {
	uint32_t ADD :4;
	uint32_t :1;
	uint32_t LBDL :1;
	uint32_t LBDIE :1;
	uint32_t :1;
	uint32_t LBCL :1;
	uint32_t CPHA :1;
	uint32_t CPOL :1;
	uint32_t CLKEN :1;
	uint32_t STOP :2;
	uint32_t LINEN :1;
	uint32_t :17;
} usart1_ctlr2_t;

typedef struct {
	uint32_t EIE :1;
	uint32_t IREN :1;
	uint32_t IRLP :1;
	uint32_t HDSEL :1;
	uint32_t NACK :1;
	uint32_t SCEN :1;
	uint32_t DMAR :1;
	uint32_t DMAT :1;
	uint32_t RTSE :1;
	uint32_t CTSE :1;
	uint32_t CTSIE :1;
	uint32_t :21;
} usart1_ctlr3_t;

typedef struct {
	uint32_t PSC :8;
	uint32_t GT :8;
	uint32_t :16;
} usart1_gpr_t;

