kabel42/ch32v003/ch32v003_mmr.h
typedef struct {
	uint32_t AWD :1;
	uint32_t EOC :1;
	uint32_t JEOC :1;
	uint32_t JSTRT :1;
	uint32_t STRT :1;
	uint32_t :27;
} adc1_statr_t;

typedef struct {
	uint32_t AWDCH :5;
	uint32_t EOCIE :1;
	uint32_t AWDIE :1;
	uint32_t JEOCIE :1;
	uint32_t SCAN :1;
	uint32_t AWDSGL :1;
	uint32_t JAUTO :1;
	uint32_t DISCEN :1;
	uint32_t JDISCEN :1;
	uint32_t DISCNUM :3;
	uint32_t :6;
	uint32_t JAWDEN :1;
	uint32_t AWDEN :1;
	uint32_t :1;
	uint32_t ADC_CAL_VOL :2;
	uint32_t :5;
} adc1_ctlr1_t;

typedef struct {
	uint32_t ADON :1;
	uint32_t CONT :1;
	uint32_t CAL :1;
	uint32_t RSTCAL :1;
	uint32_t :4;
	uint32_t DMA :1;
	uint32_t :2;
	uint32_t ALIGN :1;
	uint32_t JEXTSEL :3;
	uint32_t JEXTTRIG :1;
	uint32_t :1;
	uint32_t EXTSEL :3;
	uint32_t EXTTRIG :1;
	uint32_t JSWSTART :1;
	uint32_t SWSTART :1;
	uint32_t :9;
} adc1_ctlr2_t;

typedef struct {
	uint32_t SMP10_TKCG10 :3;
	uint32_t SMP11_TKCG11 :3;
	uint32_t SMP12_TKCG12 :3;
	uint32_t SMP13_TKCG13 :3;
	uint32_t SMP14_TKCG14 :3;
	uint32_t SMP15_TKCG15 :3;
	uint32_t :14;
} adc1_samptr1_charge1_t;

typedef struct {
	uint32_t SMP0_TKCG0 :3;
	uint32_t SMP1_TKCG1 :3;
	uint32_t SMP2_TKCG2 :3;
	uint32_t SMP3_TKCG3 :3;
	uint32_t SMP4_TKCG4 :3;
	uint32_t SMP5_TKCG5 :3;
	uint32_t SMP6_TKCG6 :3;
	uint32_t SMP7_TKCG7 :3;
	uint32_t SMP8_TKCG8 :3;
	uint32_t SMP9_TKCG9 :3;
	uint32_t :2;
} adc1_samptr2_charge2_t;

typedef struct {
	uint32_t JOFFSET1 :10;
	uint32_t :22;
} adc1_iofr1_t;

typedef struct {
	uint32_t JOFFSET2 :10;
	uint32_t :22;
} adc1_iofr2_t;

typedef struct {
	uint32_t JOFFSET3 :10;
	uint32_t :22;
} adc1_iofr3_t;

typedef struct {
	uint32_t JOFFSET4 :10;
	uint32_t :22;
} adc1_iofr4_t;

typedef struct {
	uint32_t HT :10;
	uint32_t :22;
} adc1_wdhtr_t;

typedef struct {
	uint32_t LT :10;
	uint32_t :22;
} adc1_wdltr_t;

typedef struct {
	uint32_t SQ13 :5;
	uint32_t SQ14 :5;
	uint32_t SQ15 :5;
	uint32_t SQ16 :5;
	uint32_t L :4;
	uint32_t :8;
} adc1_rsqr1_t;

typedef struct {
	uint32_t SQ7 :5;
	uint32_t SQ8 :5;
	uint32_t SQ9 :5;
	uint32_t SQ10 :5;
	uint32_t SQ11 :5;
	uint32_t SQ12 :5;
	uint32_t :2;
} adc1_rsqr2_t;

typedef struct {
	uint32_t SQ1 :5;
	uint32_t SQ2 :5;
	uint32_t SQ3 :5;
	uint32_t SQ4 :5;
	uint32_t SQ5 :5;
	uint32_t SQ6 :5;
	uint32_t :2;
} adc1_rsqr3_t;

typedef struct {
	uint32_t JSQ1 :5;
	uint32_t JSQ2 :5;
	uint32_t JSQ3 :5;
	uint32_t JSQ4 :5;
	uint32_t JL :2;
	uint32_t :10;
} adc1_isqr_t;

typedef struct {
	uint32_t IDATA :16;
	uint32_t :16;
} adc1_idatar1_t;

typedef struct {
	uint32_t IDATA :16;
	uint32_t :16;
} adc1_idatar2_t;

typedef struct {
	uint32_t IDATA :16;
	uint32_t :16;
} adc1_idatar3_t;

typedef struct {
	uint32_t IDATA :16;
	uint32_t :16;
} adc1_idatar4_t;

typedef struct {
	uint32_t DLYVLU :9;
	uint32_t DLYSRC :1;
	uint32_t :22;
} adc1_dlyr_t;

typedef struct {
	uint32_t DEG_IWDG :1;
	uint32_t DEG_WWDG :1;
	uint32_t DEG_I2C1 :1;
	uint32_t :1;
	uint32_t DEG_TIM1 :1;
	uint32_t DEG_TIM2 :1;
	uint32_t :26;
} dbg_cfgr1_t;

typedef struct {
	uint32_t DBG_SLEEP :1;
	uint32_t DBG_STOP :1;
	uint32_t DBG_STANDBY :1;
	uint32_t :29;
} dbg_cfgr2_t;

typedef struct {
	uint32_t LATENCY :1;
	uint32_t :31;
} flash_actlr_t;

typedef struct {
	uint32_t BSY :1;
	uint32_t :3;
	uint32_t WRPRTERR :1;
	uint32_t EOP :1;
	uint32_t :8;
	uint32_t BOOT_MODE :1;
	uint32_t BOOT_LOCK :1;
	uint32_t :16;
} flash_statr_t;

typedef struct {
	uint32_t PG :1;
	uint32_t PER :1;
	uint32_t MER :1;
	uint32_t :1;
	uint32_t OBPG :1;
	uint32_t OBER :1;
	uint32_t STRT :1;
	uint32_t LOCK :1;
	uint32_t :1;
	uint32_t OBWRE :1;
	uint32_t ERRIE :1;
	uint32_t :1;
	uint32_t EOPIE :1;
	uint32_t :2;
	uint32_t FLOCK :1;
	uint32_t PAGE_PG :1;
	uint32_t PAGE_ER :1;
	uint32_t BUFLOAD :1;
	uint32_t BUFRST :1;
	uint32_t :12;
} flash_ctlr_t;

typedef struct {
	uint32_t OBERR :1;
	uint32_t RDPRT :1;
	uint32_t IWDG_SW :1;
	uint32_t STOP_RST :1;
	uint32_t STANDY_RST :1;
	uint32_t CFG_RST_MODE :2;
	uint32_t :3;
	uint32_t DATA0 :8;
	uint32_t DATA1 :8;
	uint32_t :6;
} flash_obr_t;

typedef struct {
	uint32_t :2;
	uint32_t INTENSTA2_3 :2;
	uint32_t :8;
	uint32_t INTENSTA12_31 :20;
} pfic_isr1_t;

typedef struct {
	uint32_t INTENSTA :8;
	uint32_t :24;
} pfic_isr4_t;

typedef struct {
	uint32_t :2;
	uint32_t PENDSTA2_3 :2;
	uint32_t :8;
	uint32_t PENDSTA12_31 :20;
} pfic_ipr1_t;

typedef struct {
	uint32_t PENDSTA :8;
	uint32_t :24;
} pfic_ipr4_t;

typedef struct {
	uint32_t THRESHOLD :8;
	uint32_t :24;
} pfic_ithresdr_t;

typedef struct {
	uint32_t :7;
	uint32_t RESETSYS :1;
	uint32_t :8;
	uint32_t KEYCODE :16;
} pfic_cfgr_t;

typedef struct {
	uint32_t NESTSTA :8;
	uint32_t GACTSTA :1;
	uint32_t GPENDSTA :1;
	uint32_t :22;
} pfic_gisr_t;

typedef struct {
	uint32_t VTFID0 :8;
	uint32_t VTFID1 :8;
	uint32_t VTFID2 :8;
	uint32_t VTFID3 :8;
} pfic_vtfidr_t;

typedef struct {
	uint32_t VTF0EN :1;
	uint32_t  ADDR0 :31;
} pfic_vtfaddrr0_t;

typedef struct {
	uint32_t VTF1EN :1;
	uint32_t  ADDR1 :31;
} pfic_vtfaddrr1_t;

typedef struct {
	uint32_t VTF2EN :1;
	uint32_t  ADDR2 :31;
} pfic_vtfaddrr2_t;

typedef struct {
	uint32_t VTF3EN :1;
	uint32_t  ADDR3 :31;
} pfic_vtfaddrr3_t;

typedef struct {
	uint32_t :12;
	uint32_t INTEN :20;
} pfic_ienr1_t;

typedef struct {
	uint32_t INTEN :8;
	uint32_t :24;
} pfic_ienr4_t;

typedef struct {
	uint32_t :12;
	uint32_t INTRSET :20;
} pfic_irer1_t;

typedef struct {
	uint32_t INTRSET :8;
	uint32_t :24;
} pfic_irer4_t;

typedef struct {
	uint32_t :2;
	uint32_t PENDSET2_3 :2;
	uint32_t :8;
	uint32_t PENDSET12_31 :20;
} pfic_ipsr1_t;

typedef struct {
	uint32_t PENDSET :8;
	uint32_t :24;
} pfic_ipsr4_t;

typedef struct {
	uint32_t :2;
	uint32_t PENDRESET2_3 :2;
	uint32_t :8;
	uint32_t PENDRESET12_31 :20;
} pfic_iprr1_t;

typedef struct {
	uint32_t PENDRESET :8;
	uint32_t :24;
} pfic_iprr4_t;

typedef struct {
	uint32_t :2;
	uint32_t IACTS2_3 :2;
	uint32_t :8;
	uint32_t IACTS12_31 :20;
} pfic_iactr1_t;

typedef struct {
	uint32_t IACTS :8;
	uint32_t :24;
} pfic_iactr4_t;

typedef struct {
	uint32_t :1;
	uint32_t SLEEPONEXIT :1;
	uint32_t SLEEPDEEP :1;
	uint32_t WFITOWFE :1;
	uint32_t SEVONPEND :1;
	uint32_t SETEVENT :1;
	uint32_t :25;
	uint32_t SYSRESET :1;
} pfic_sctlr_t;

typedef struct {
	uint32_t STE :1;
	uint32_t STIE :1;
	uint32_t STCLK :1;
	uint32_t STRE :1;
	uint32_t MODE :1;
	uint32_t INIT :1;
	uint32_t :25;
	uint32_t SWIE :1;
} pfic_stk_ctlr_t;

typedef struct {
	uint32_t CNTIF :1;
	uint32_t :31;
} pfic_stk_sr_t;

